import React from 'react';
import {Container, Row} from "react-bootstrap";
import Footer from "../components/footer";
import {useTranslation} from 'react-i18next';
import {Helmet} from "react-helmet";

const Info = props => {
    const {t} = useTranslation();

    return (
        <>
            <Helmet>
                <meta charSet="utf-8" />
                <title>Общие сведения о кредитах</title>
                <link rel="canonical" href="https://eazy-credit.com.ua" />
            </Helmet>
            <Container>
                <p className='fs-3 mt-3 text-center fw-light'>{t('Общие сведения')}</p>
            </Container>
            <Container className='bg-light '>

                <Row className='mt-3 p-3'>
                    <p className='fs-3'>Загальні умови і вимоги до позичальника</p>
                    <p>
                        <ul>
                            <li>
                                Постійний житель України у віці від 18&nbsp;років з будь-якою кредитною історією та
                                діючий
                                номер телефону.
                            </li>
                        </ul>
                    </p>
                    <p className='fs-3'>Умови для отримання кредиту:</p>
                    <p>
                        <ul>
                            <li>
                                Перший кредит можна отримати в розмірі від 100 ₴ до 100 000 ₴, якщо своєчасно буде
                                здійснена
                                виплата кредиту. Кредитори пропонують різні періоди виплат із знижкою 99% від комісійної
                                плати
                                за кредит, &nbsp;більше інформації на домашній сторінці кожного кредитора.
                            </li>
                            <li>
                                Перший раз подаючи заявку на кредит онлайн, необхідно зареєструватись, і позичальник
                                погоджується з умовами надання кредиту.
                            </li>
                            <li>
                                Кредитор, одержавши заявку на отримання кредиту, розглядає її і, в разі отримання
                                позитивної
                                відповіді, перераховує кошти. &nbsp;Кошти можна отримати в середньому протягом 15
                                хвилин,
                                після
                                подання заявки на кредит.
                            </li>
                            <li>
                                Беручи кредит повторно, позичальнику потрібно лише вибрати суму коштів і строк виплати.
                            </li>
                        </ul>
                    </p>
                    <p className='fs-3'>Річна процентна ставка (Annual Percentage Rate APR)</p>
                    <p>Річна процентна ставка - це загальні витрати за кредитом, що виражаються у відсотках. У
                        розрахунок
                        річної відсоткової ставки не включено витрати, які пов'язані з невиконанням зобов’язань за
                        кредитним
                        договором. Річна процентна ставка для кредитів може становити до 1095% річних.</p>
                    <p className='fs-3'>Штрафні платежі або інформація щодо політики відновлення</p>
                    <p>У випадку, якщо сума кредиту не буде виплачена в зазначений строк, кредитор може вимагати
                        штрафний
                        платіж від загальної суми простроченого платежу за кожний день прострочення. У випадку, якщо
                        виплата
                        не здійснюється протягом тривалого періоду, без узгодження з кредитором, кредитор має право в
                        односторонньому порядку передати стягнення кредиту третім компаніям.</p>
                    <p>Сплативши кредит вчасно, створюється позитивна кредитна історія, яка в майбутньому буде
                        підвищувати
                        шанси отримати кредит на вигідних умовах.</p>
                </Row>
            </Container>
            <Footer/>
        </>

    );
};

Info.propTypes = {};

export default Info;
