const resources = {
    ru: {
        translation: {
            "Welcome to React": "Welcome to React and react-i18next",
            "Сумма до": "Сумма до",
            "Срок до": "Срок до",
            "на 1й кредит": "на 1й кредит",
            "Возраст": "Возраст",
            "Рейтинг": "Рейтинг",
            "Получить деньги": "Получить деньги",
            "Информация о кредиторе": "Информация о кредиторе",
            "Назад": "Назад",
            "дней": "дней",
            "информация о компании": "Домашняя страница easy-credit.com.ua не является кредитором и не выдает кредиты. Во всех кредиторов, в отношении которых приведены сравнения, есть соответствующая лицензия кредитного учреждения.",
            "Рейтинг МФО": "Рейтинг МФО",
            "Часто задаваемые вопросы": "Часто задаваемые вопросы",
            "Общие сведения": "Общие сведения",
            "Файлы cookies": "Файлы cookies",
            "Использование": "Использование",
            "Защита данных": "Защита данных",
            "Оформить кредит":"Оформить кредит",
            "ставка по кредиту":"ставка по кредиту"
        }
    },
    uk: {
        translation: {
            "Welcome to React": "Bienvenue à React et react-i18next",
            "Сумма до": "Сума до",
            "Срок до": "Термін до",
            "на 1й кредит": "на 1й кредит",
            "Возраст": "Вік",
            "Рейтинг": "Рейтинг",
            "Получить деньги": "Отримати гроші",
            "Информация о кредиторе": "Інформація про кредитора",
            "Назад": "Повернутися",
            "дней": "днів",
            "информация о компании": "Домашня сторінка easy-credit.com.ua не є кредитором і не видає кредити. У всіх кредиторів, щодо яких приведено порівняння, є відповідна ліцензія кредитної установи.",
            "Рейтинг МФО": "Рейтинг МФО",
            "Часто задаваемые вопросы": "Поширені запитання",
            "Общие сведения": "Загальні відомості",
            "Файлы cookies": "Файли cookies",
            "Использование": "Використання",
            "Защита данных": "Захист даних",
            "Оформить кредит":"Оформити кредит",
            "ставка по кредиту":"відсотки по кредиту"
        }
    }
};

export {resources}